public class Main {
    public static void main(String[] args) {

        int costTicket = 1_000;
        int rubles = 20;
        int bonusMiles = costTicket / rubles;

        System.out.println(bonusMiles);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
